app/controllers/posts_controller.rb

  def index
     @posts = Post.all.order("created_at desc").paginate(page: params[:page], per_page: 3)
---
SELECT COUNT(*) FROM "posts"