app/controllers/projects_controller.rb

  def index
    @projects = Project.all.order("created_at desc")
---
SELECT "projects".* FROM "projects" ORDER BY created_at desc

  def find_project
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]